<script lang="ts" setup>
import Footer from '~/components/Footer.vue';
import Slider from '~/components/Slider.vue';
import { useGameStore } from '~/stores/game'
import { useAuthStore } from '~/stores/auth'

const authStore = useAuthStore()
const gameStore = useGameStore()
const gameLoginUrl = ref('');

onMounted(async () => {
  gameLoginUrl.value = await gameStore.autoLogin();
  //console.log(gameLoginUrl.value)
});


const openGame = async () => {
  if (!gameLoginUrl.value) {
    alert('ยังไม่พร้อมใช้งาน กรุณารอสักครู่');
    return;
  }
  if (authStore.user) {
    const credit = parseFloat(authStore.user.ufabet_credit)
    if (credit > 0) {
      window.open(gameLoginUrl.value, '_blank');
    }
  }
  await navigateTo('/deposit')
  gameLoginUrl.value = '';


  try {
    gameLoginUrl.value = await gameStore.autoLogin();
    //console.log(gameLoginUrl.value)

  } catch (error) {
    console.error('Auto login failed:', error);
  }

};


useHead({
  title: "คาสิโนออนไลน์",
  meta: [
    {
      name: "description",
      content:
        "คาสิโนออนไลน์เว็บตรง ที่กำลังมาแรงในปีนี้ที่สุด เว็บคาสิโนออนไลน์อันดับ1ของโลก เสิร์ฟความสนุกที่ทำให้การเล่นของคุณไม่เหมือนที่อื่นๆ",
    },
  ],
});
</script>
<template>
  <Slider class="slider-top" />
  <div class="_game_intro">
    <ul class="box-game-flex">
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/img-ae7.png.webp" alt="AE Casino" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/ht-2.png.webp" alt="AE SEXY" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/img-bbin-live.png.webp" alt="bbin live" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/img-evo.png.webp" alt="EVOLUTION" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/lc-2.png.webp" alt="SA GAMING" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/lc-3.png.webp" alt="eBET" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/lc-5.png.webp" alt="VENUS CASINO" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/img-bg.png.webp" alt="BGGAMING" width="280" class="-img" />
      </li>
      <li class="-game-block -casino-slot" @click="openGame()">
        <img src="/images/games/casino/img-nanyang.png.webp" alt="WORLD ENTERTAINMENT" width="280" class="-img" />
      </li>
    </ul>
  </div>

  <div class="-content-data">
    <h1>คาสิโนออนไลน์ เปิดประสบการณ์ การเดิมพันรูปแบบใหม่ไม่เหมือนใคร</h1>
    <p>
      เว็บน้องใหม่ได้รับความนิยมสูง <em>คาสิโนออนไลน์เว็บตรง</em>
      ที่กำลังมาแรงในปีนี้ที่สุด เว็บคาสิโนออนไลน์อันดับ1ของโลก
      เสิร์ฟความสนุกที่ทำให้การเล่นของคุณไม่เหมือนที่อื่น คาสิโนออนไลน์
      การันตีความแปลกใหม่คุณต้องลองเข้าเล่น
      เรานำเสนอเกมคาสิโนที่ส่งตรงจากห้องคาสิโนสด
      เหมือนได้เข้าไปสัมผัสบรรยากาศพื้นที่จริง
    </p>
    <h2>คาสิโนออนไลน์ พื้นที่บริการเกมออนไลน์รูปแบบใหม่ ตัวจริงไม่พูดมาก</h2>
    <p>
      ตัวเลือกที่มีให้คุณแบบไม่จำกัด คาสิโนออนไลน์
      เสิร์ฟความสนุกแบบจัดหนักจัดเต็ม
      <a href="https://ufascbx.com/slot"><strong>สล็อตออนไลน์</strong></a>
      พื้นที่บริการเกมออนไลน์รูปแบบใหม่
      ให้คุณมาลองเปิดประสบการณ์ใหม่ที่เรารวบรวมคัดสรรการเล่นที่ไม่เหมือนใคร
      เกมชั้นนำมากกว่า 35 ค่าย รับรองคุณภาพการันตีความมัน
      ที่ส่งตรงจากเว็บใหญ่ที่ให้ความคุ้มค่าอย่างแน่นอน ตัวจริงไม่พูดมาก
      พบกับเกมกงล้อมหาสนุกที่ให้ความสุขแบบหยุดไม่อยู่ เล่นจนติดใจ
      แล้วจะมีที่ไหนอีกที่เล่นเกมออนไลน์แล้วได้เงินจริง
    </p>
    <p>
      เว็บน้องใหม่มาแรงที่สุดแบบปังปุริเย่ในตอนนี้ รวมทั้งสล็อตคลาสสิก
      และโปรเกรสซีฟแจ็กพอต มีบางสิ่งสำหรับทุกคนบน "สล็อตเว็บตรง" นอกจากนี้
      ด้วยความสะดวกสบายที่สามารถเล่นได้จากคอมพิวเตอร์หรืออุปกรณ์เคลื่อนที่
      ให้คุณสามารถนำประสบการณ์การเล่นเกมติดตัวไปได้ทุกที่ เดิมพันได้อย่างคุ้มค่า
    </p>
    <h2>คาสิโนออนไลน์ ลงทุนน้อย แต่ผลตอบแทนสูง</h2>
    <p>
      เข้าเล่นช่องทางทำเงินกับ <em>คาสิโนออนไลน์</em>
      เกมเดิมพันที่จะตอบโจทย์ผู้เล่นรูปแบบใหม่ ไม่จำเป็นต้องลงทุนเยอะ
      ลงทุนน้อยก็สามารถจะเข้าเล่นได้อย่างเมามันส์ แต่ผลตอบแทนสูง
      ยุคใหม่แห่งการเดิมพันไม่จำกัดวงเงิน
      เปิดโอกาสให้ผู้เล่นมือใหม่ที่อยากลองเล่น
      ได้เข้ามามีส่วนร่วมในเกมคาสิโนของเรา
    </p>
    <p>
      ระบบเกมที่เสถียรที่สุด ยุคใหม่แห่งวงการเกมสล็อตออนไลน์
      หากคุณกำลังลังเลและยังไม่รู้จะเลือกเล่นที่ไหนดี
      เราขอแนะนำพื้นที่แหล่งรวมเกมสล็อตแห่งนี้
      สมัครสมาชิกครั้งเดียวสามารถเข้าเดิมพันได้ทั้งหมดในพื้นที่แห่งนี้
      เราบริการอย่างจริงใจดูแลลูกค้าเหมือนครอบครัว
      ตอบรับทุกข้อสงสัยหรือปัญหาต่าง ๆ พร้อมพัฒนาระบบให้แปลกใหม่และเสถียรที่สุด
      ให้การเล่นของคุณลื่นไหลไม่มีกระตุก ไม่ทำให้อารมณ์เสีย
    </p>
    <h2>เปิดบริการให้เดิมพัน คาสิโนออนไลน์ สล็อต ได้ทุกช่วงเวลา</h2>
    <p>
      คาสิโนออนไลน์ สล็อต เกมออนไลน์สุดคลาสสิกรูปแบบใหม่
      ที่คนไทยที่ชื่นชอบการเล่นเดิมพันที่ให้ความสนุกอย่างเมามันส์ ได้ทุกช่วงเวลา
      ไม่ว่าจะมีเวลาว่างตอนไหนก็สามารถเข้าเล่นได้หมด
      เกมปั่นวงล้อของเรามีเกมให้เลือกเล่นอย่างล้นหลาม
      <em>เปิดบริการให้เดิมพัน</em>
      ทั้งวันทั้งคืนไม่มีการปิด
      เรามีระบบหลังบ้านที่คอยอัปเดตความสนุกให้ผู้เล่นมีการเล่นได้อย่างสบายใจ
      ที่คุณไม่ต้องห่วงเรื่องการโกงหรือปัญหาดูดเงิน
    </p>
    <p>
      ให้การเล่น 24 ชม. ของคุณอย่างคุ้มค่า
      ทุกช่วงเวลาการเล่นมีโบนัสที่ให้ผู้เล่น เกมที่ให้ความคุ้มค่าอย่างมหาศาล
      รับรองว่าถ้าได้เข้าเล่นแล้วจะทำให้คุณติดใจจนไม่สามารถกล้าที่จะออกเกมได้เลย
      เพราะเราให้โบนัสแก่ผู้เล่นทุกคน มีการแจกแบบจัดหนักจัดเต็ม
      ไม่ว่าจะเลือกเล่นเกมไหนเราก็แจกได้ให้ทุกคนที่เข้ามาเป็นส่วนหนึ่งของเว็บไซต์เรา
    </p>
    <h3>
      ช่องทางการชำระเงินที่รวดเร็วและปลอดภัย เว็บคาสิโนออนไลน์อันดับ1ของโลก
    </h3>
    <p>
      สำหรับผู้เล่นให้เว็บของเรา เรามีระบบการเงินที่ดี
      ช่องทางการชำระเงินที่รวดเร็วและปลอดภัย
      พร้อมให้คุณเข้าเดิมพันได้ทุกธนาคารชั้นนำของประเทศไทย
      ที่เปิดโอกาสให้ผู้เล่นสามารถใช้งานได้อย่างสะดวกสบายหมดห่วงปัญหาเรื่องการชำระเงินเข้าเดิมพัน
      <strong>เว็บคาสิโนออนไลน์อันดับ1ของโลก</strong>
      เว็บตรงที่ปลอดภัยที่สุดที่คุณต้องเข้ามาสมัครเท่านั้น
      มั่นคงที่สุดโดยคุณสามารถเข้ามาสมัครทดลองเล่นได้ไม่มีผิดหวังแน่นอน
    </p>
    <p>
      ระบบเกมของเราปลอดภัยอย่างมาก
      ที่ให้การเดิมพันของคุณไม่ต้องห่วงเรื่องความปลอดภัยเลย
      ระบบของเรามีผู้ดูแลตลอดเวลา ดูแลอย่างดี การเงินมั่นคงที่สุดในเอเชีย
      เว็บที่ดีที่สุดในตอนนี้ที่ไม่ทำให้คุณผิดหวังอย่างแน่นอน
      เราการันตีจากเหล่าผู้เล่นตัวจริงมาแล้ว
      รับรองว่าถ้าเข้ามาเล่นพื้นที่บริการอย่างเสรีของเรา เชื่อใจได้เลยว่าปลอดภัย
      100 %
    </p>
    <h3>ตัวเลือกที่หลากหลาย คาสิโนออนไลน์ 1 บาท ก็เข้าเล่นได้</h3>
    <p>
      เว็บเดิมพัน <em>คาสิโนออนไลน์</em> ที่เปิดโอกาสให้กับผู้เล่นมือใหม่
      หรือนักพนันมือใหม่
      ที่ได้เข้ามาเป็นลงทะเบียนสมาชิกกับทางเราได้เล่นเกมที่ไม่ต้องห่วงเรื่องเงินในการเงิน
      1 บาท ก็เข้าเล่นได้ เรามาเกมคาสิโนที่ให้คุณเล่นอย่างล้นหลาม
      ให้คุณได้เข้าเล่นได้อย่างสบายใจ ตัวเลือกเกมที่หลากหลาย
      จากค่ายเกมชั้นนำแบรนด์ดังที่เหล่าเซียนพนันให้ความสนใจเข้าเล่น
      ค่ายเกมที่เปิดบริการส่งตรงจากเว็บใหญ่เว็บแท้ ตัวแม่แห่งวงการเดิมพัน
    </p>
    <p>
      เดิมพันเกมออนไลน์เงินดีได้อย่างสนุก
      นำเสนอแพลตฟอร์มที่เข้าใช้งานง่ายพร้อมอินเทอร์เฟซเกมที่ร่วมสนุกและใช้งานง่าย
      การสนับสนุนลูกค้าที่ยอดเยี่ยม แล้วทำไมไม่ลองเสี่ยงโชคดูว่าเกมสล็อตของเรา
      มีอะไรให้เล่นบ้าง
      เพื่อวิธีที่สะดวกและน่าตื่นเต้นในการเล่นเกมที่คุณชื่นชอบจากความสะดวกสบายในบ้านของคุณเอง
      ไม่ว่าจะอยู่ที่ไหนก็สามารถเข้าเล่นได้ตลอดเวลา กับการบริการที่ดีเยี่ยม
      ที่หนึ่งเรื่องความมั่นคงทางการเงิน
      เข้าเล่นเลยเพราะเกมคาสิโนของเรามีตัวเลือกให้เล่นได้ครบวงจร
      ครบครันที่สุดเท่าที่หามาให้คุณเล่น
    </p>
    <h2>ค่ายคาสิโนออนไลน์ รองรับทุกการใช้งาน ผ่านอุปกรณ์อิเล็กทรอนิกซ์</h2>
    <p>
      ค่ายคาสิโนออนไลน์ ตอบโจทย์ทุกสไตล์ของสายนักลงทุนที่เข้ามาเดิมพันกับทางเรา
      ไม่ว่าคุณจะมีอุปกรณ์ชนิดไหนในการเข้าเล่น ไม่ว่าจะเป็นโทรศัพท์ แท็บเล็ต
      หรือคอมพิวเตอร์ โดนคุณสามารถเข้ามาสนุกกับทางเรา
      <em>ผ่านอุปกรณ์อิเล็กทรอนิกซ์</em>
      ที่สามารถเชื่อมต่อสัญญาณเครือข่ายอินเทอร์เน็ต
      เพียงแค่นี้ก็สามารถเล่นได้แล้ว มั่นใจได้หายห่วงว่ากลัวจะไม่ได้เล่น
      รองรับทุกการใช้งาน ทุกแพลตฟอร์มที่คุณมี สะดวกสบายต่อการเข้าเล่นอย่างมาก
    </p>
    <p>
      ไม่ว่าจะอยู่ที่ไหนก็สามารถเข้าเล่นได้
      หากคุณมีมือถือเครื่องเดียวที่เชื่อมต่ออินเทอร์เน็ต
      หากจะเดินทางไปไหนแล้วต้องการเข้าเดิมพันก็สามารถเล่นได้ หรือหากอยู่บ้านสบาย
      ๆ แล้วมีคอมพิวเตอร์ตั้งโต๊ะสักเครื่อง
      ก็สามารถเข้าหน้าเว็บไซต์เพื่อเดิมพันเกมคาสิโนของเราได้เลย
      จอใหญ่มองเห็นการเล่นที่จัดเต็ม โทรศัพท์เครื่องเล็กก็พกพาการเล่นที่สะดวก
      ไม่ว่าจะมีอุปกรณ์ไหนก็เล่นได้หายห่วงเลยค่ะ
    </p>
    <h2>เข้าเล่นง่าย คาสิโนออนไลน์ สล็อต ไม่ต้องดาวน์โหลดให้เสียเวลา</h2>
    <p>
      เพิ่มความสะดวกสบายไปมากกว่านั้น คาสิโนออนไลน์ สล็อต
      เปิดบริการเดิมพันเกมออนไลน์สุดไฮเทคเข้าเล่นง่าย
      ดีกรีคุณภาพให้ผู้เล่นไม่ต้องมีขั้นตอนอะไรที่ยุ่งยาก
      เพียงเข้าหน้าเว็บไซต์ของเราสมัคร และล็อกอินเข้าเล่นได้เลย
      <em>ไม่ต้องดาวน์โหลดให้เสียเวลา</em> การบริการที่ดีขนาดนี้
      ไม่เล่นแล้วจะพลาดอย่างมาก
      เพราะระบบหน้าเว็บของเราได้ออกแบบให้มีการใช้งานที่ง่าย ไม่ซับซ้อน
    </p>
    <p>
      การออกแบบของเว็บเราได้ถูกออกแบบให้ผู้เล่นเข้าถึงง่าย ไม่ยุ่งยากอย่างที่คิด
      เพราะพื้นที่บริการเกมคาสิโนแห่งนี้ เปิดบริการสำหรับทุกเพศทุกวัย
      เราเลยต้องออกแบบให้การใช้งานเหมาะกับทุกช่วงอายุของผู้เล่น
      ไม่ว่าจะเด็กหรือผู้ใหญ่วัยกลางคน ก็เข้าเล่นได้อย่างง่ายดาย
    </p>
    <h3>จุดเด่นที่ไม่เหมือนใคร เว็บเดิมพันแนวใหม่ คาสิโนออนไลน์เว็บตรง</h3>
    <p>
      การเล่นเกมคาสิโนได้มีมาอย่างยาวนาน
      หากใครที่เป็นแฟนพันธุ์แท้ของเกมเดิมพันแล้ว คาสิโนออนไลน์เว็บตรง
      ได้บ่งบอกว่าเป็นตัวเลือกที่ดีที่สุดให้คุณในตอนนี้
      เพราะไม่ต้องกลัวเรื่องผิดกฎหมาย
      และทางเราไม่มีประวัติเรื่องความเสียหายแก่ผู้เล่น
      <em>เว็บเดิมพันแนวใหม่</em>
      เพราะเว็บของเราเป็นเว็บตรงที่ได้การยอมรับเป็นเว็บมาตรฐานสากล
      จุดเด่นที่ไม่เหมือนใคร คือช่องทางการรับโบนัสที่คุณจะได้รับด้วยความบังเอิญ
      มีการสุ่มแจกรางวัลให้กับสมาชิกทุกท่าน
      สมัครฟรีไม่มีการเสียค่าใช้จ่ายในการสมัครเข้าเล่นครั้งแรก
    </p>
    <p>
      การันตีได้เลยว่าเว็บของเราไม่มีการเปิดเผยตัวตนหรือข้อมูลผู้เล่น
      ทำให้การเล่นของคุณเป็นอย่างส่วนตัว ไม่ต้องห่วงว่าใครมาจะรู้การเล่นของคุณ
      เราปิดข้อมูลไว้เป็นความลับอย่างดี พร้อมระบบ ฝาก - ถอน ที่รวดเร็วที่สุด
      ที่ผ่านระบบอัตโนมัติที่มั่นใจได้เลยว่าไม่มีปัญหาเรื่องการโกงเงินอย่างแน่นอน
      เล่นได้ทุกที่ทุกช่วงเวลาที่ต้องการได้เลย
    </p>
    <h3>
      เสิร์ฟความคุ้มค่า เว็บคาสิโนออนไลน์อันดับ1ของโลก
      แจกหนักแบบหาจากที่ไหนไม่ได้
    </h3>
    <p>
      เหตุใดจึงไม่ลองสิ่งใหม่ ๆ <em>เสิร์ฟความคุ้มค่า</em>
      และสัมผัสกับคุณลักษณะเฉพาะของ
      คุณไม่มีทางรู้หรอกว่าเกมที่น่าตื่นเต้นหรือชัยชนะครั้งใหญ่สามารถอยู่แค่คลิกเดียว
      เว็บคาสิโนออนไลน์อันดับ1ของโลก เว็บแท้ที่ได้ลิขสิทธิ์มาจากเว็บใหญ่
      ไม่ว่าจะเป็นผู้เล่นใหม่หรือเก่า แจกหนักแบบหาจากที่ไหนไม่ได้
      ด้วยโบนัสจากทางเรา คุณรอรับได้เลยหลังจากการสมัครใหม่
      เว็บที่ให้ได้ยิ่งกว่าให้ เว็บใหม่ที่กำลังมาแรงที่สุดในตอนนี้
    </p>
    <p>
      ยิ่งไปกว่านั้นคุณสามารถทดลองการเล่นได้โดยไม่ต้องเติมเงิน
      ให้คุณได้ทดลองเล่นเกมของเราได้ก่อนการลงเดิมพันจริง
      เพื่อให้คุณทดสอบเกมของเราเมามันส์ได้ไม่อั้น
      หากคุณเป็นสายปั่นสล็อตต้องห้ามพลาดกับความสนุกแบบไร้ขีดจำกัด
      เว็บตรงที่ดีที่สุดในไทย เป็นตัวเลือกที่ดีที่สุดในตอนนี้
      รับรองว่าไม่ทำให้คุณผิดหวัง เปิดมุมมองใหม่แห่งการเข้าเล่นสล็อต
      รวบรวมความสนุกไว้ในที่เดียว โดยที่คุณสามารถทำเงินได้อย่างง่ายดาย
    </p>
    <h3>สรุป คาสิโนออนไลน์ เว็บเดิมพันสุดฮิตบริการครบครันทุกวงจร</h3>
    <p>
      เข้ามาเปิดประสบการณ์กับทางเรา ลงทะเบียนสมัครสมาชิกผ่านทางหน้าเว็บไซต์
      หรือผ่านทางไลน์แอดได้เลย คาสิโนออนไลน์
      เว็บเดิมพันรูปแบบใหม่ที่เปิดบริการให้คุณได้เข้ามาสัมผัสความสนุกอย่างเมามันส์
      ที่จะพาคุณไปทำเงินจากการเล่นเกมได้อย่างง่าย ๆ ไม่ว่าจะเป็นสล็อต บาคาร่า
      คาสิโนสด
      <a href="https://ufascbx.com/card"><strong>ไพ่แคงออนไลน์</strong></a>
      เว็บเกมเดิมพันสุดฮิตบริการครบครันทุกวงจร ทุนน้อยผลตอบแทนที่ให้กำไรอย่างงาม
      หาจากที่ไหนไม่ได้แล้ว
      พื้นที่บริการของเราบริการอย่างจริงใจที่ให้ผู้เล่นเชื่อมั่นเข้ามาใช้งาน
    </p>
    <p>
      หากคุณกำลังลังเล หรือมองหาตัวเลือกในการเข้าเล่น
      อย่างรอช้าที่จะสมัครเข้ามาในช่องทางแห่งนี้
      หากคุณพลาดหรือมองข้ามเว็บเดิมพันนี้ไป สิ่งดี ๆ
      ที่เรากำลังจะมอบให้สิทธิ์นั้นจะหายไปเลย เชื่อใจกับทางเรา
      เปิดโอกาสตัวเองให้มองหาและเลือกสิ่งที่ดีที่สุดให้กับตัวคุณเอง
      หากเลือกผิดก็แค่เลือกใหม่ พื้นที่แห่งนี้พร้อมบริการคุณแล้ว
      เราสนับสนุนผู้เล่นทุกคนให้เดิมพันอย่างสบายใจ ถูกใจผู้เล่นอย่างแน่นอน
      เราดูแลคุณอย่างจริงใจ ที่คุณจะหาจากที่ไหนไม่ได้แล้ว
    </p>
  </div>

  <QueenClub />
  <Footer />
</template>
